app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT * FROM `books`

  def hobo
    @title = "Books"
    @book = Book.find(params[:id])
    @large_book = LargeBook.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 1)
SELECT * FROM `large_books` WHERE (`large_books`.`id` = 1)

  def show
    @title = "Making It"
    @book = "makingit"
    @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 0)