app/controllers/prints_controller.rb

SELECT * FROM `prints` WHERE (`prints`.`id` = 1)
---
  def show
    @title = "Prints"  # only to get passing tests - may delete many of CRUD methods
    @print = Print.find(params[:id])